--- src/cache.rs
+++ delete ! in CacheManager::ensure_cached
@@ -112,17 +112,17 @@
         } else {
             debug!("cache miss, cloning to {path}");
             self.clone_repo(source, &repo_path)?;
         }
 
         let overlay_path = match &source.subpath {
             Some(subpath) => {
                 let path = repo_path.join(subpath);
-                if !path.exists() {
+                if  /* ~ changed by cargo-mutants ~ */path.exists() {
                     let subpath_display = subpath.display();
                     let owner = &source.owner;
                     let repo = &source.repo;
                     bail!("Subpath '{subpath_display}' not found in repository {owner}/{repo}");
                 }
                 path
             }
             None => repo_path.clone(),
