--- src/cache.rs
+++ replace || with && in CacheManager::clone_repo
@@ -179,17 +179,17 @@
         cmd.arg(target);
 
         let output = cmd.output().context("Failed to execute git clone")?;
 
         if !output.status.success() {
             let stderr = String::from_utf8_lossy(&output.stderr);
             let owner = &source.owner;
             let repo = &source.repo;
-            if stderr.contains("not found") || stderr.contains("Repository not found") {
+            if stderr.contains("not found") && /* ~ changed by cargo-mutants ~ */ stderr.contains("Repository not found") {
                 bail!("Repository not found: {owner}/{repo}");
             }
             if stderr.contains("could not find remote branch") {
                 let git_ref = source.git_ref.as_str();
                 bail!("Branch or tag not found: {git_ref} in {owner}/{repo}");
             }
             let msg = stderr.trim();
             bail!("Failed to clone repository: {msg}");
