--- src/cache.rs
+++ replace git_in_dir -> Result<Output> with Ok(Default::default())
@@ -10,22 +10,17 @@
 use std::fs;
 use std::path::{Path, PathBuf};
 use std::process::{Command, Output};
 
 use crate::github::{GitHubSource, GitRef};
 
 /// Execute a git command in a directory and return the output.
 fn git_in_dir(repo_path: &Path, args: &[&str]) -> Result<Output> {
-    trace!("git {} in {}", args.join(" "), repo_path.display()); // args.join() not inlinable
-    Command::new("git")
-        .args(args)
-        .current_dir(repo_path)
-        .output()
-        .with_context(|| format!("Failed to execute git {}", args.first().unwrap_or(&""))) // unwrap_or not inlinable
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */ // unwrap_or not inlinable
 }
 
 /// Execute a git command in a directory and check for success.
 fn git_run(repo_path: &Path, args: &[&str]) -> Result<()> {
     let output = git_in_dir(repo_path, args)?;
     if output.status.success() {
         Ok(())
     } else {
