--- src/cache.rs
+++ replace CacheManager::update_repo -> Result<()> with Ok(())
@@ -200,19 +200,17 @@
             self.fetch_commit(target, sha)?;
         }
 
         Ok(())
     }
 
     /// Update an existing cached repository.
     fn update_repo(&self, repo_path: &Path) -> Result<()> {
-        let path = repo_path.display();
-        debug!("fetching updates for {path}");
-        git_run(repo_path, &["fetch", "--depth", "1", "origin"]).context("Failed to fetch updates")
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Checkout a specific ref.
     fn checkout_ref(&self, repo_path: &Path, source: &GitHubSource) -> Result<()> {
         let git_ref = source.git_ref.as_str();
         debug!("checkout_ref: {git_ref}");
         let ref_spec = match &source.git_ref {
             GitRef::Default => "origin/HEAD",
