--- src/cache.rs
+++ replace CacheManager::checkout_ref -> Result<()> with Ok(())
@@ -207,36 +207,17 @@
     fn update_repo(&self, repo_path: &Path) -> Result<()> {
         let path = repo_path.display();
         debug!("fetching updates for {path}");
         git_run(repo_path, &["fetch", "--depth", "1", "origin"]).context("Failed to fetch updates")
     }
 
     /// Checkout a specific ref.
     fn checkout_ref(&self, repo_path: &Path, source: &GitHubSource) -> Result<()> {
-        let git_ref = source.git_ref.as_str();
-        debug!("checkout_ref: {git_ref}");
-        let ref_spec = match &source.git_ref {
-            GitRef::Default => "origin/HEAD",
-            GitRef::Branch(b) => {
-                // For branches, try origin/branch first
-                let origin_ref = format!("origin/{b}");
-                if self.ref_exists(repo_path, &origin_ref)? {
-                    debug!("using remote ref: {origin_ref}");
-                    return self.do_checkout(repo_path, &origin_ref);
-                }
-                // Fall back to local ref
-                debug!("remote ref not found, falling back to local: {b}");
-                b.as_str()
-            }
-            GitRef::Tag(t) => t.as_str(),
-            GitRef::Commit(c) => c.as_str(),
-        };
-
-        self.do_checkout(repo_path, ref_spec)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Check if a ref exists in the repository.
     fn ref_exists(&self, repo_path: &Path, ref_spec: &str) -> Result<bool> {
         let output = git_in_dir(repo_path, &["rev-parse", "--verify", ref_spec])?;
         Ok(output.status.success())
     }
 
