--- src/cache.rs
+++ replace CacheManager::ref_exists -> Result<bool> with Ok(false)
@@ -231,18 +231,17 @@
             GitRef::Commit(c) => c.as_str(),
         };
 
         self.do_checkout(repo_path, ref_spec)
     }
 
     /// Check if a ref exists in the repository.
     fn ref_exists(&self, repo_path: &Path, ref_spec: &str) -> Result<bool> {
-        let output = git_in_dir(repo_path, &["rev-parse", "--verify", ref_spec])?;
-        Ok(output.status.success())
+        Ok(false) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Perform the actual checkout.
     fn do_checkout(&self, repo_path: &Path, ref_spec: &str) -> Result<()> {
         git_run(repo_path, &["checkout", ref_spec])
             .with_context(|| format!("Failed to checkout {ref_spec}"))
     }
 
