--- src/cache.rs
+++ replace CacheManager::fetch_commit -> Result<()> with Ok(())
@@ -244,26 +244,17 @@
     fn do_checkout(&self, repo_path: &Path, ref_spec: &str) -> Result<()> {
         git_run(repo_path, &["checkout", ref_spec])
             .with_context(|| format!("Failed to checkout {ref_spec}"))
     }
 
     /// Fetch a specific commit.
     fn fetch_commit(&self, repo_path: &Path, sha: &str) -> Result<()> {
         // First, unshallow if needed to access the commit (ignore errors - might already be complete)
-        let _ = git_in_dir(repo_path, &["fetch", "--unshallow", "origin"]);
-
-        // Fetch the specific commit
-        let short_sha = &sha[..12.min(sha.len())];
-        git_run(repo_path, &["fetch", "origin", sha])
-            .with_context(|| format!("Failed to fetch commit {short_sha}"))?;
-
-        // Checkout the commit
-        git_run(repo_path, &["checkout", sha])
-            .with_context(|| format!("Failed to checkout commit {short_sha}"))
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the current commit SHA.
     fn get_current_commit(&self, repo_path: &Path) -> Result<String> {
         let output = git_in_dir(repo_path, &["rev-parse", "HEAD"])?;
         if !output.status.success() {
             bail!("Failed to get current commit");
         }
