--- src/cache.rs
+++ delete ! in CacheManager::get_current_commit
@@ -259,17 +259,17 @@
         // Checkout the commit
         git_run(repo_path, &["checkout", sha])
             .with_context(|| format!("Failed to checkout commit {short_sha}"))
     }
 
     /// Get the current commit SHA.
     fn get_current_commit(&self, repo_path: &Path) -> Result<String> {
         let output = git_in_dir(repo_path, &["rev-parse", "HEAD"])?;
-        if !output.status.success() {
+        if  /* ~ changed by cargo-mutants ~ */output.status.success() {
             bail!("Failed to get current commit");
         }
         Ok(String::from_utf8(output.stdout)?.trim().to_string())
     }
 
     /// Save cache metadata.
     fn save_meta(&self, repo_path: &Path, source: &GitHubSource, commit: &str) -> Result<()> {
         let meta = CacheMeta {
