--- src/cache.rs
+++ replace CacheManager::save_meta -> Result<()> with Ok(())
@@ -267,27 +267,17 @@
         if !output.status.success() {
             bail!("Failed to get current commit");
         }
         Ok(String::from_utf8(output.stdout)?.trim().to_string())
     }
 
     /// Save cache metadata.
     fn save_meta(&self, repo_path: &Path, source: &GitHubSource, commit: &str) -> Result<()> {
-        let meta = CacheMeta {
-            clone_url: source.clone_url(),
-            last_fetched: Utc::now(),
-            requested_ref: source.git_ref.as_str().to_string(),
-            commit: commit.to_string(),
-        };
-
-        let meta_path = repo_path.join(".repoverlay-cache-meta.ccl");
-        fs::write(&meta_path, sickle::to_string(&meta)?)?;
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Load cache metadata.
     fn load_meta(&self, repo_path: &Path) -> Option<CacheMeta> {
         let meta_path = repo_path.join(".repoverlay-cache-meta.ccl");
         if meta_path.exists() {
             match fs::read_to_string(&meta_path) {
                 Ok(content) => match sickle::from_str(&content) {
