--- src/cache.rs
+++ replace git_run -> Result<()> with Ok(())
@@ -20,25 +20,17 @@
         .args(args)
         .current_dir(repo_path)
         .output()
         .with_context(|| format!("Failed to execute git {}", args.first().unwrap_or(&""))) // unwrap_or not inlinable
 }
 
 /// Execute a git command in a directory and check for success.
 fn git_run(repo_path: &Path, args: &[&str]) -> Result<()> {
-    let output = git_in_dir(repo_path, args)?;
-    if output.status.success() {
-        Ok(())
-    } else {
-        let stderr = String::from_utf8_lossy(&output.stderr);
-        let cmd = args.first().unwrap_or(&"");
-        let msg = stderr.trim();
-        bail!("git {cmd} failed: {msg}")
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Metadata about a cached repository.
 #[derive(Debug, Deserialize, Serialize)]
 pub struct CacheMeta {
     /// The clone URL
     pub clone_url: String,
     /// When the cache was last fetched
