--- src/cache.rs
+++ replace CacheManager::load_meta -> Option<CacheMeta> with None
@@ -282,33 +282,17 @@
         let meta_path = repo_path.join(".repoverlay-cache-meta.ccl");
         fs::write(&meta_path, sickle::to_string(&meta)?)?;
 
         Ok(())
     }
 
     /// Load cache metadata.
     fn load_meta(&self, repo_path: &Path) -> Option<CacheMeta> {
-        let meta_path = repo_path.join(".repoverlay-cache-meta.ccl");
-        if meta_path.exists() {
-            match fs::read_to_string(&meta_path) {
-                Ok(content) => match sickle::from_str(&content) {
-                    Ok(meta) => return Some(meta),
-                    Err(e) => {
-                        let path = meta_path.display();
-                        warn!("failed to parse cache meta {path}: {e}");
-                    }
-                },
-                Err(e) => {
-                    let path = meta_path.display();
-                    warn!("failed to read cache meta {path}: {e}");
-                }
-            }
-        }
-        None
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// List all cached repositories.
     pub fn list_cached(&self) -> Result<Vec<CachedRepoInfo>> {
         let github_dir = self.cache_dir.join("github");
 
         if !github_dir.exists() {
             return Ok(Vec::new());
