--- src/cache.rs
+++ replace CacheManager::list_cached -> Result<Vec<CachedRepoInfo>> with Ok(vec![Default::default()])
@@ -303,54 +303,17 @@
                 }
             }
         }
         None
     }
 
     /// List all cached repositories.
     pub fn list_cached(&self) -> Result<Vec<CachedRepoInfo>> {
-        let github_dir = self.cache_dir.join("github");
-
-        if !github_dir.exists() {
-            return Ok(Vec::new());
-        }
-
-        let mut repos = Vec::new();
-
-        for owner_entry in fs::read_dir(&github_dir)? {
-            let owner_entry = owner_entry?;
-            if !owner_entry.file_type()?.is_dir() {
-                continue;
-            }
-
-            let owner = owner_entry.file_name().to_string_lossy().to_string();
-
-            for repo_entry in fs::read_dir(owner_entry.path())? {
-                let repo_entry = repo_entry?;
-                if !repo_entry.file_type()?.is_dir() {
-                    continue;
-                }
-
-                let repo = repo_entry.file_name().to_string_lossy().to_string();
-                let path = repo_entry.path();
-                let meta = self.load_meta(&path);
-
-                repos.push(CachedRepoInfo {
-                    owner: owner.clone(),
-                    repo,
-                    path,
-                    meta,
-                });
-            }
-        }
-
-        repos.sort_by(|a, b| (&a.owner, &a.repo).cmp(&(&b.owner, &b.repo)));
-
-        Ok(repos)
+        Ok(vec![Default::default()]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Remove a specific cached repository.
     pub fn remove_cached(&self, owner: &str, repo: &str) -> Result<bool> {
         let path = self.cache_dir.join("github").join(owner).join(repo);
 
         if path.exists() {
             fs::remove_dir_all(&path)?;
