--- src/cache.rs
+++ delete ! in CacheManager::list_cached
@@ -305,17 +305,17 @@
         }
         None
     }
 
     /// List all cached repositories.
     pub fn list_cached(&self) -> Result<Vec<CachedRepoInfo>> {
         let github_dir = self.cache_dir.join("github");
 
-        if !github_dir.exists() {
+        if  /* ~ changed by cargo-mutants ~ */github_dir.exists() {
             return Ok(Vec::new());
         }
 
         let mut repos = Vec::new();
 
         for owner_entry in fs::read_dir(&github_dir)? {
             let owner_entry = owner_entry?;
             if !owner_entry.file_type()?.is_dir() {
