--- src/cache.rs
+++ delete ! in CacheManager::list_cached
@@ -313,17 +313,17 @@
         if !github_dir.exists() {
             return Ok(Vec::new());
         }
 
         let mut repos = Vec::new();
 
         for owner_entry in fs::read_dir(&github_dir)? {
             let owner_entry = owner_entry?;
-            if !owner_entry.file_type()?.is_dir() {
+            if  /* ~ changed by cargo-mutants ~ */owner_entry.file_type()?.is_dir() {
                 continue;
             }
 
             let owner = owner_entry.file_name().to_string_lossy().to_string();
 
             for repo_entry in fs::read_dir(owner_entry.path())? {
                 let repo_entry = repo_entry?;
                 if !repo_entry.file_type()?.is_dir() {
