--- src/cache.rs
+++ replace CacheManager::remove_cached -> Result<bool> with Ok(true)
@@ -345,31 +345,17 @@
 
         repos.sort_by(|a, b| (&a.owner, &a.repo).cmp(&(&b.owner, &b.repo)));
 
         Ok(repos)
     }
 
     /// Remove a specific cached repository.
     pub fn remove_cached(&self, owner: &str, repo: &str) -> Result<bool> {
-        let path = self.cache_dir.join("github").join(owner).join(repo);
-
-        if path.exists() {
-            fs::remove_dir_all(&path)?;
-
-            // Clean up empty parent directories
-            let owner_dir = self.cache_dir.join("github").join(owner);
-            if owner_dir.exists() && owner_dir.read_dir()?.next().is_none() {
-                fs::remove_dir(&owner_dir)?;
-            }
-
-            Ok(true)
-        } else {
-            Ok(false)
-        }
+        Ok(true) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Clear the entire cache.
     pub fn clear_cache(&self) -> Result<usize> {
         let github_dir = self.cache_dir.join("github");
 
         if !github_dir.exists() {
             return Ok(0);
