--- src/cache.rs
+++ replace CacheManager::clear_cache -> Result<usize> with Ok(1)
@@ -364,28 +364,17 @@
             Ok(true)
         } else {
             Ok(false)
         }
     }
 
     /// Clear the entire cache.
     pub fn clear_cache(&self) -> Result<usize> {
-        let github_dir = self.cache_dir.join("github");
-
-        if !github_dir.exists() {
-            return Ok(0);
-        }
-
-        let repos = self.list_cached()?;
-        let count = repos.len();
-
-        fs::remove_dir_all(&github_dir)?;
-
-        Ok(count)
+        Ok(1) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Check for updates to a cached repository.
     ///
     /// Returns the latest commit on the default branch if different from current.
     pub fn check_for_updates(&self, source: &GitHubSource) -> Result<Option<String>> {
         let repo_path = self.repo_path(source);
 
