--- src/cache.rs
+++ replace CacheManager::check_for_updates -> Result<Option<String>> with Ok(Some("xyzzy".into()))
@@ -382,52 +382,17 @@
 
         Ok(count)
     }
 
     /// Check for updates to a cached repository.
     ///
     /// Returns the latest commit on the default branch if different from current.
     pub fn check_for_updates(&self, source: &GitHubSource) -> Result<Option<String>> {
-        let repo_path = self.repo_path(source);
-
-        if !repo_path.exists() {
-            return Ok(None);
-        }
-
-        let current_commit = self.get_current_commit(&repo_path)?;
-
-        // Fetch latest
-        let output = git_in_dir(&repo_path, &["fetch", "--depth", "1", "origin"])?;
-        if !output.status.success() {
-            return Ok(None);
-        }
-
-        // Get the remote HEAD commit
-        let ref_spec = match &source.git_ref {
-            GitRef::Default => "origin/HEAD".to_string(),
-            GitRef::Branch(b) => format!("origin/{b}"),
-            GitRef::Tag(_) | GitRef::Commit(_) => {
-                // Tags and commits don't have "updates"
-                return Ok(None);
-            }
-        };
-
-        let output = git_in_dir(&repo_path, &["rev-parse", &ref_spec])?;
-        if !output.status.success() {
-            return Ok(None);
-        }
-
-        let remote_commit = String::from_utf8(output.stdout)?.trim().to_string();
-
-        if remote_commit == current_commit {
-            Ok(None)
-        } else {
-            Ok(Some(remote_commit))
-        }
+        Ok(Some("xyzzy".into())) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Get the cache directory.
 pub fn cache_dir() -> Result<PathBuf> {
     let proj_dirs = ProjectDirs::from("", "", "repoverlay")
         .ok_or_else(|| anyhow::anyhow!("Could not determine cache directory"))?;
 
