--- src/cache.rs
+++ replace == with != in CacheManager::check_for_updates
@@ -413,17 +413,17 @@
 
         let output = git_in_dir(&repo_path, &["rev-parse", &ref_spec])?;
         if !output.status.success() {
             return Ok(None);
         }
 
         let remote_commit = String::from_utf8(output.stdout)?.trim().to_string();
 
-        if remote_commit == current_commit {
+        if remote_commit != /* ~ changed by cargo-mutants ~ */ current_commit {
             Ok(None)
         } else {
             Ok(Some(remote_commit))
         }
     }
 }
 
 /// Get the cache directory.
