--- src/sources.rs
+++ delete ! in SourceManager::pull_all
@@ -94,17 +94,17 @@
             ms.manager.ensure_cloned()?;
         }
         Ok(())
     }
 
     /// Pull updates for all sources.
     pub fn pull_all(&self) -> Result<()> {
         for ms in &self.sources {
-            if !ms.manager.needs_clone() {
+            if  /* ~ changed by cargo-mutants ~ */ms.manager.needs_clone() {
                 ms.manager.pull()?;
             }
         }
         Ok(())
     }
 
     /// Resolve an overlay reference against all sources in priority order.
     ///
