--- src/sources.rs
+++ replace SourceManager::find_all_matches -> Vec<(Source, ResolvedVia)> with vec![]
@@ -169,33 +169,17 @@
     #[allow(dead_code)] // Utility method for future `resolve` command
     pub fn find_all_matches(
         &self,
         org: &str,
         repo: &str,
         name: &str,
         upstream: Option<&UpstreamInfo>,
     ) -> Vec<(Source, ResolvedVia)> {
-        let mut matches = Vec::new();
-
-        for ms in &self.sources {
-            // Skip sources that aren't cloned
-            if ms.manager.needs_clone() {
-                continue;
-            }
-
-            if let Ok((_, resolved_via)) = ms
-                .manager
-                .get_overlay_path_with_fallback(org, repo, name, upstream)
-            {
-                matches.push((ms.source.clone(), resolved_via));
-            }
-        }
-
-        matches
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// List overlay names for a specific org/repo across all sources.
     ///
     /// Returns unique overlay names (deduplicated across sources).
     #[must_use]
     pub fn list_overlays_for_repo(&self, org: &str, repo: &str) -> Vec<OverlayName> {
         let mut names = std::collections::HashSet::new();
