--- src/sources.rs
+++ replace SourceManager::list_overlays_for_repo -> Vec<OverlayName> with vec![]
@@ -193,34 +193,17 @@
         matches
     }
 
     /// List overlay names for a specific org/repo across all sources.
     ///
     /// Returns unique overlay names (deduplicated across sources).
     #[must_use]
     pub fn list_overlays_for_repo(&self, org: &str, repo: &str) -> Vec<OverlayName> {
-        let mut names = std::collections::HashSet::new();
-
-        for ms in &self.sources {
-            // Skip sources that aren't cloned
-            if ms.manager.needs_clone() {
-                continue;
-            }
-
-            if let Ok(overlays) = ms.manager.list_overlays_for_repo(org, repo) {
-                for overlay in overlays {
-                    names.insert(OverlayName::new(overlay.name));
-                }
-            }
-        }
-
-        let mut result: Vec<_> = names.into_iter().collect();
-        result.sort();
-        result
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// List all overlays across all sources.
     #[allow(dead_code)] // Utility method for future multi-source `list` command
     pub fn list_all_overlays(&self) -> Result<Vec<(Source, AvailableOverlay)>> {
         let mut all = Vec::new();
 
         for ms in &self.sources {
