--- src/sources.rs
+++ replace SourceManager::list_all_overlays -> Result<Vec<(Source, AvailableOverlay)>> with Ok(vec![])
@@ -216,31 +216,17 @@
         let mut result: Vec<_> = names.into_iter().collect();
         result.sort();
         result
     }
 
     /// List all overlays across all sources.
     #[allow(dead_code)] // Utility method for future multi-source `list` command
     pub fn list_all_overlays(&self) -> Result<Vec<(Source, AvailableOverlay)>> {
-        let mut all = Vec::new();
-
-        for ms in &self.sources {
-            // Skip sources that aren't cloned
-            if ms.manager.needs_clone() {
-                continue;
-            }
-
-            let overlays = ms.manager.list_overlays()?;
-            for overlay in overlays {
-                all.push((ms.source.clone(), overlay));
-            }
-        }
-
-        Ok(all)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use std::fs;
     use std::path::Path;
