--- src/sources.rs
+++ replace sources_cache_dir -> Result<PathBuf> with Ok(Default::default())
@@ -36,19 +36,17 @@
 /// Sources are checked in order during resolution. The first source
 /// containing the requested overlay wins.
 pub struct SourceManager {
     sources: Vec<ManagedSource>,
 }
 
 /// Cache directory for sources.
 fn sources_cache_dir() -> Result<PathBuf> {
-    let base = directories::ProjectDirs::from("", "", "repoverlay")
-        .ok_or_else(|| anyhow::anyhow!("Could not determine cache directory"))?;
-    Ok(base.cache_dir().join("sources"))
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 impl SourceManager {
     /// Create a new source manager from a list of sources.
     ///
     /// Each source is configured to clone to a subdirectory within the cache.
     pub fn new(sources: Vec<Source>) -> Result<Self> {
         let cache_dir = sources_cache_dir()?;
