--- src/sources.rs
+++ replace SourceManager::source_names -> Vec<&str> with vec![]
@@ -68,20 +68,17 @@
         Ok(Self {
             sources: managed_sources,
         })
     }
 
     /// Get the list of source names in priority order.
     #[must_use]
     pub fn source_names(&self) -> Vec<&str> {
-        self.sources
-            .iter()
-            .map(|s| s.source.name.as_str())
-            .collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get a source by name.
     #[allow(dead_code)] // Utility method for future use
     pub fn get_source(&self, name: &str) -> Option<&Source> {
         self.sources
             .iter()
             .find(|s| s.source.name == name)
