--- src/sources.rs
+++ replace SourceManager::get_source -> Option<&Source> with None
@@ -77,20 +77,17 @@
             .iter()
             .map(|s| s.source.name.as_str())
             .collect()
     }
 
     /// Get a source by name.
     #[allow(dead_code)] // Utility method for future use
     pub fn get_source(&self, name: &str) -> Option<&Source> {
-        self.sources
-            .iter()
-            .find(|s| s.source.name == name)
-            .map(|s| &s.source)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Ensure all sources are cloned.
     pub fn ensure_all_cloned(&self) -> Result<()> {
         for ms in &self.sources {
             ms.manager.ensure_cloned()?;
         }
         Ok(())
