--- src/sources.rs
+++ replace SourceManager::ensure_all_cloned -> Result<()> with Ok(())
@@ -85,20 +85,17 @@
         self.sources
             .iter()
             .find(|s| s.source.name == name)
             .map(|s| &s.source)
     }
 
     /// Ensure all sources are cloned.
     pub fn ensure_all_cloned(&self) -> Result<()> {
-        for ms in &self.sources {
-            ms.manager.ensure_cloned()?;
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Pull updates for all sources.
     pub fn pull_all(&self) -> Result<()> {
         for ms in &self.sources {
             if !ms.manager.needs_clone() {
                 ms.manager.pull()?;
             }
