--- src/state.rs
+++ replace OverlaySource::overlay_repo_full -> Self with Default::default()
@@ -120,24 +120,17 @@
     pub const fn overlay_repo_full(
         org: String,
         repo: String,
         name: String,
         commit: String,
         resolved_via: ResolvedVia,
         source_name: String,
     ) -> Self {
-        Self::OverlayRepo {
-            org,
-            repo,
-            name,
-            commit,
-            resolved_via: Some(resolved_via),
-            source_name: Some(source_name),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get a display string for the source.
     #[allow(dead_code)]
     pub fn display(&self) -> String {
         match self {
             Self::Local { path } => path.display().to_string(),
             Self::GitHub {
