--- src/state.rs
+++ replace OverlaySource::display -> String with String::new()
@@ -133,52 +133,17 @@
             resolved_via: Some(resolved_via),
             source_name: Some(source_name),
         }
     }
 
     /// Get a display string for the source.
     #[allow(dead_code)]
     pub fn display(&self) -> String {
-        match self {
-            Self::Local { path } => path.display().to_string(),
-            Self::GitHub {
-                url,
-                git_ref,
-                commit,
-                ..
-            } => {
-                format!("{} ({}@{})", url, git_ref, &commit[..12.min(commit.len())])
-            }
-            Self::OverlayRepo {
-                org,
-                repo,
-                name,
-                commit,
-                resolved_via,
-                source_name,
-            } => {
-                let via = match resolved_via {
-                    Some(ResolvedVia::Upstream) => " via upstream",
-                    _ => "",
-                };
-                let source = source_name
-                    .as_ref()
-                    .map_or_else(String::new, |s| format!(" [{s}]"));
-                format!(
-                    "{}/{}/{}{}{} (@{})",
-                    org,
-                    repo,
-                    name,
-                    via,
-                    source,
-                    &commit[..12.min(commit.len())]
-                )
-            }
-        }
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Check if this is a GitHub source.
     #[allow(dead_code)]
     pub const fn is_github(&self) -> bool {
         matches!(self, Self::GitHub { .. })
     }
 
