--- src/state.rs
+++ delete match arm Some(ResolvedVia::Upstream) in OverlaySource::display
@@ -152,17 +152,17 @@
                 org,
                 repo,
                 name,
                 commit,
                 resolved_via,
                 source_name,
             } => {
                 let via = match resolved_via {
-                    Some(ResolvedVia::Upstream) => " via upstream",
+                     /* ~ changed by cargo-mutants ~ */
                     _ => "",
                 };
                 let source = source_name
                     .as_ref()
                     .map_or_else(String::new, |s| format!(" [{s}]"));
                 format!(
                     "{}/{}/{}{}{} (@{})",
                     org,
