--- src/state.rs
+++ replace <impl SourceResolver for OverlaySource>::resolve_local_path -> Result<PathBuf> with Ok(Default::default())
@@ -236,56 +236,17 @@
     fn is_updatable(&self) -> bool;
 
     /// Human-readable description of the source type for messages.
     fn source_type_label(&self) -> &'static str;
 }
 
 impl SourceResolver for OverlaySource {
     fn resolve_local_path(&self) -> Result<PathBuf> {
-        match self {
-            Self::Local { path } => Ok(path.clone()),
-            Self::OverlayRepo {
-                org,
-                repo,
-                name,
-                source_name,
-                ..
-            } => {
-                use crate::config::load_config;
-                use crate::overlay_repo::OverlayRepoManager;
-
-                let config = load_config(None)?;
-                let overlay_config =
-                    config.get_overlay_repo_config_by_name(source_name.as_deref())?;
-                let manager = OverlayRepoManager::new(overlay_config)?;
-                manager.ensure_cloned()?;
-                manager.get_overlay_path(org, repo, name)
-            }
-            Self::GitHub {
-                owner,
-                repo,
-                git_ref,
-                subpath,
-                ..
-            } => {
-                use crate::cache::CacheManager;
-                use crate::github::{GitHubSource, GitRef};
-
-                let cache = CacheManager::new()?;
-                let source = GitHubSource {
-                    owner: owner.clone(),
-                    repo: repo.clone(),
-                    git_ref: GitRef::Branch(git_ref.clone()),
-                    subpath: subpath.as_ref().map(PathBuf::from),
-                };
-                let cached = cache.ensure_cached(&source, false)?;
-                Ok(cached.path)
-            }
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn is_mutable(&self) -> bool {
         match self {
             Self::Local { .. } | Self::OverlayRepo { .. } => true,
             Self::GitHub { .. } => false,
         }
     }
