--- src/state.rs
+++ replace <impl SourceResolver for OverlaySource>::is_syncable -> bool with true
@@ -286,20 +286,17 @@
     fn is_mutable(&self) -> bool {
         match self {
             Self::Local { .. } | Self::OverlayRepo { .. } => true,
             Self::GitHub { .. } => false,
         }
     }
 
     fn is_syncable(&self) -> bool {
-        match self {
-            Self::OverlayRepo { .. } => true,
-            Self::Local { .. } | Self::GitHub { .. } => false,
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn is_updatable(&self) -> bool {
         match self {
             Self::OverlayRepo { .. } | Self::GitHub { .. } => true,
             Self::Local { .. } => false,
         }
     }
