--- src/state.rs
+++ replace OverlayState::remove_file -> Option<FileEntry> with None
@@ -354,21 +354,17 @@
     /// Add a file entry to the state.
     pub fn add_file(&mut self, entry: FileEntry) {
         self.files.push(entry);
     }
 
     /// Remove a file entry by target path. Returns the removed entry, or None if not found.
     #[allow(dead_code)]
     pub fn remove_file(&mut self, target: &Path) -> Option<FileEntry> {
-        if let Some(pos) = self.files.iter().position(|f| f.target == target) {
-            Some(self.files.remove(pos))
-        } else {
-            None
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the number of files in the overlay.
     #[allow(clippy::missing_const_for_fn)]
     pub fn file_count(&self) -> usize {
         self.files.len()
     }
 
