--- src/state.rs
+++ replace OverlayState::file_count -> usize with 0
@@ -364,17 +364,17 @@
         } else {
             None
         }
     }
 
     /// Get the number of files in the overlay.
     #[allow(clippy::missing_const_for_fn)]
     pub fn file_count(&self) -> usize {
-        self.files.len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Iterate over file entries.
     pub fn file_entries(&self) -> &[FileEntry] {
         &self.files
     }
 }
 
