--- src/state.rs
+++ replace OverlayState::file_entries -> &[FileEntry] with Vec::leak(Vec::new())
@@ -369,17 +369,17 @@
     /// Get the number of files in the overlay.
     #[allow(clippy::missing_const_for_fn)]
     pub fn file_count(&self) -> usize {
         self.files.len()
     }
 
     /// Iterate over file entries.
     pub fn file_entries(&self) -> &[FileEntry] {
-        &self.files
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A file entry in the overlay state.
 #[derive(Debug, Clone, Deserialize, Serialize)]
 pub struct FileEntry {
     pub source: PathBuf,
     pub target: PathBuf,
