--- src/state.rs
+++ replace external_state_dir -> Result<PathBuf> with Ok(Default::default())
@@ -431,20 +431,17 @@
     pub description: Option<String>,
 }
 
 /// Get the external state directory for storing backup state.
 ///
 /// Location: `~/.local/share/repoverlay/applied/` (Linux/macOS)
 /// or `%LOCALAPPDATA%\repoverlay\applied\` (Windows)
 pub fn external_state_dir() -> Result<PathBuf> {
-    let proj_dirs = ProjectDirs::from("", "", "repoverlay")
-        .ok_or_else(|| anyhow::anyhow!("Could not determine data directory"))?;
-
-    Ok(proj_dirs.data_dir().join("applied"))
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Get the external state directory for a specific target repository.
 ///
 /// Uses a hash of the canonical target path to create a unique directory.
 pub fn external_state_dir_for_target(target: &Path) -> Result<PathBuf> {
     let base = external_state_dir()?;
     let target_hash = hash_path(target);
