--- src/state.rs
+++ delete ! in save_external_state
@@ -454,17 +454,17 @@
 /// Save overlay state to the external backup location.
 pub fn save_external_state(target: &Path, overlay_name: &str, state: &OverlayState) -> Result<()> {
     debug!("save_external_state: {overlay_name}");
     let dir = external_state_dir_for_target(target)?;
     fs::create_dir_all(&dir)?;
 
     // Also save a marker file with the original target path for debugging
     let marker_path = dir.join(".target_path");
-    if !marker_path.exists() {
+    if  /* ~ changed by cargo-mutants ~ */marker_path.exists() {
         fs::write(&marker_path, target.display().to_string())?;
     }
 
     let state_file = dir.join(format!("{overlay_name}.ccl"));
     let content = sickle::to_string(state).context("Failed to serialize state to CCL")?;
     fs::write(&state_file, content)?;
 
     Ok(())
