--- src/state.rs
+++ replace remove_external_state -> Result<()> with Ok(())
@@ -471,33 +471,17 @@
 }
 
 /// Mark overlay state as removed in the external backup location.
 ///
 /// Instead of deleting the external state, we mark it with a `removed_at` timestamp.
 /// This allows `restore` to distinguish between overlays that were intentionally
 /// removed vs. those that are missing due to `git clean`.
 pub fn remove_external_state(target: &Path, overlay_name: &str) -> Result<()> {
-    let dir = external_state_dir_for_target(target)?;
-    let state_file = dir.join(format!("{overlay_name}.ccl"));
-
-    if state_file.exists() {
-        // Read existing state and mark it as removed
-        let content = fs::read_to_string(&state_file)?;
-        if let Ok(mut state) = sickle::from_str::<OverlayState>(&content) {
-            state.removed_at = Some(Utc::now());
-            let updated_content = sickle::to_string(&state).context("Failed to serialize state")?;
-            fs::write(&state_file, updated_content)?;
-        } else {
-            // If we can't parse it, just delete it
-            fs::remove_file(&state_file)?;
-        }
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Load all overlay states from the external backup location for a target.
 ///
 /// Only returns states that are eligible for restoration (not marked as removed).
 pub fn load_external_states(target: &Path) -> Result<Vec<OverlayState>> {
     debug!("load_external_states: {}", target.display());
     let dir = external_state_dir_for_target(target)?;
