--- src/state.rs
+++ replace load_external_states -> Result<Vec<OverlayState>> with Ok(vec![Default::default()])
@@ -494,49 +494,17 @@
 
     Ok(())
 }
 
 /// Load all overlay states from the external backup location for a target.
 ///
 /// Only returns states that are eligible for restoration (not marked as removed).
 pub fn load_external_states(target: &Path) -> Result<Vec<OverlayState>> {
-    debug!("load_external_states: {}", target.display());
-    let dir = external_state_dir_for_target(target)?;
-
-    if !dir.exists() {
-        debug!("no external state directory found");
-        return Ok(Vec::new());
-    }
-
-    let mut states = Vec::new();
-
-    for entry in fs::read_dir(&dir)? {
-        let entry = entry?;
-        let path = entry.path();
-
-        if path.extension().is_some_and(|e| e == "ccl")
-            && path.file_name() != Some(std::ffi::OsStr::new(".target_path"))
-        {
-            let content = fs::read_to_string(&path)?;
-            if let Ok(state) = sickle::from_str::<OverlayState>(&content) {
-                // Skip overlays that were explicitly removed
-                if state.removed_at.is_some() {
-                    debug!(
-                        "skipping removed overlay '{}' (removed at {:?})",
-                        state.name, state.removed_at
-                    );
-                    continue;
-                }
-                states.push(state);
-            }
-        }
-    }
-
-    Ok(states)
+    Ok(vec![Default::default()]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Hash a path to create a unique identifier.
 fn hash_path(path: &Path) -> String {
     let mut hasher = DefaultHasher::new();
     path.to_string_lossy().hash(&mut hasher);
     format!("{:016x}", hasher.finish())
 }
