--- src/state.rs
+++ replace == with != in load_external_states
@@ -508,17 +508,17 @@
     }
 
     let mut states = Vec::new();
 
     for entry in fs::read_dir(&dir)? {
         let entry = entry?;
         let path = entry.path();
 
-        if path.extension().is_some_and(|e| e == "ccl")
+        if path.extension().is_some_and(|e| e != /* ~ changed by cargo-mutants ~ */ "ccl")
             && path.file_name() != Some(std::ffi::OsStr::new(".target_path"))
         {
             let content = fs::read_to_string(&path)?;
             if let Ok(state) = sickle::from_str::<OverlayState>(&content) {
                 // Skip overlays that were explicitly removed
                 if state.removed_at.is_some() {
                     debug!(
                         "skipping removed overlay '{}' (removed at {:?})",
