--- src/state.rs
+++ replace hash_path -> String with "xyzzy".into()
@@ -531,19 +531,17 @@
         }
     }
 
     Ok(states)
 }
 
 /// Hash a path to create a unique identifier.
 fn hash_path(path: &Path) -> String {
-    let mut hasher = DefaultHasher::new();
-    path.to_string_lossy().hash(&mut hasher);
-    format!("{:016x}", hasher.finish())
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Generate the start marker for a git exclude section.
 pub fn exclude_marker_start(name: &str) -> String {
     format!("# repoverlay:{name} start")
 }
 
 /// Generate the end marker for a git exclude section.
