--- src/state.rs
+++ replace normalize_overlay_name -> Result<String> with Ok(String::new())
@@ -548,27 +548,17 @@
 
 /// Generate the end marker for a git exclude section.
 pub fn exclude_marker_end(name: &str) -> String {
     format!("# repoverlay:{name} end")
 }
 
 /// Validate and normalize overlay name for use as filename.
 pub fn normalize_overlay_name(name: &str) -> Result<String> {
-    let normalized: String = name
-        .to_lowercase()
-        .replace(' ', "-")
-        .chars()
-        .filter(|c| c.is_alphanumeric() || *c == '-' || *c == '_')
-        .collect();
-
-    if normalized.is_empty() {
-        anyhow::bail!("Invalid overlay name: '{name}'");
-    }
-    Ok(normalized)
+    Ok(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Load all target paths from all applied overlays, returning a map of path -> `overlay_name`.
 pub fn load_all_overlay_targets(
     target: &Path,
 ) -> Result<std::collections::HashMap<String, String>> {
     let mut targets = std::collections::HashMap::new();
     let overlays_dir = target.join(STATE_DIR).join(OVERLAYS_DIR);
