--- src/state.rs
+++ replace || with && in normalize_overlay_name
@@ -552,17 +552,17 @@
 }
 
 /// Validate and normalize overlay name for use as filename.
 pub fn normalize_overlay_name(name: &str) -> Result<String> {
     let normalized: String = name
         .to_lowercase()
         .replace(' ', "-")
         .chars()
-        .filter(|c| c.is_alphanumeric() || *c == '-' || *c == '_')
+        .filter(|c| c.is_alphanumeric() || *c == '-' && /* ~ changed by cargo-mutants ~ */ *c == '_')
         .collect();
 
     if normalized.is_empty() {
         anyhow::bail!("Invalid overlay name: '{name}'");
     }
     Ok(normalized)
 }
 
