--- src/state.rs
+++ delete ! in list_applied_overlays
@@ -595,17 +595,17 @@
 
     Ok(targets)
 }
 
 /// List all applied overlays, returning their normalized names.
 pub fn list_applied_overlays(target: &Path) -> Result<Vec<OverlayName>> {
     let overlays_dir = target.join(STATE_DIR).join(OVERLAYS_DIR);
 
-    if !overlays_dir.exists() {
+    if  /* ~ changed by cargo-mutants ~ */overlays_dir.exists() {
         return Ok(Vec::new());
     }
 
     let mut names: Vec<OverlayName> = fs::read_dir(&overlays_dir)?
         .filter_map(std::result::Result::ok)
         .filter(|e| e.path().extension().is_some_and(|ext| ext == "ccl"))
         .filter_map(|e| {
             e.path()
