--- src/state.rs
+++ replace == with != in list_applied_overlays
@@ -601,17 +601,17 @@
     let overlays_dir = target.join(STATE_DIR).join(OVERLAYS_DIR);
 
     if !overlays_dir.exists() {
         return Ok(Vec::new());
     }
 
     let mut names: Vec<OverlayName> = fs::read_dir(&overlays_dir)?
         .filter_map(std::result::Result::ok)
-        .filter(|e| e.path().extension().is_some_and(|ext| ext == "ccl"))
+        .filter(|e| e.path().extension().is_some_and(|ext| ext != /* ~ changed by cargo-mutants ~ */ "ccl"))
         .filter_map(|e| {
             e.path()
                 .file_stem()
                 .map(|s| OverlayName::new(s.to_string_lossy().to_string()))
         })
         .collect();
 
     names.sort();
