--- src/state.rs
+++ replace save_overlay_state -> Result<()> with Ok(())
@@ -629,26 +629,17 @@
     let content = fs::read_to_string(&state_file)
         .with_context(|| format!("Failed to read overlay state: {name}"))?;
 
     sickle::from_str(&content).with_context(|| format!("Failed to parse overlay state: {name}"))
 }
 
 /// Save an overlay state to the in-repo state file.
 pub fn save_overlay_state(target: &Path, state: &OverlayState) -> Result<()> {
-    let overlays_dir = target.join(STATE_DIR).join(OVERLAYS_DIR);
-    fs::create_dir_all(&overlays_dir)?;
-
-    let normalized_name = normalize_overlay_name(&state.name)?;
-    let state_file = overlays_dir.join(format!("{normalized_name}.ccl"));
-
-    let content = sickle::to_string(state).context("Failed to serialize overlay state")?;
-    fs::write(&state_file, content)?;
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use tempfile::TempDir;
 
     #[test]
