--- src/state.rs
+++ replace OverlaySource::local -> Self with Default::default()
@@ -76,17 +76,17 @@
         #[serde(default, skip_serializing_if = "Option::is_none")]
         source_name: Option<String>,
     },
 }
 
 impl OverlaySource {
     /// Create a new local source.
     pub const fn local(path: PathBuf) -> Self {
-        Self::Local { path }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Create a new GitHub source.
     pub fn github(
         url: String,
         owner: String,
         repo: String,
         git_ref: String,
