--- src/state.rs
+++ replace OverlaySource::github -> Self with Default::default()
@@ -88,25 +88,17 @@
     pub fn github(
         url: String,
         owner: String,
         repo: String,
         git_ref: String,
         commit: String,
         subpath: Option<String>,
     ) -> Self {
-        Self::GitHub {
-            url,
-            owner,
-            repo,
-            git_ref,
-            commit,
-            subpath,
-            cached_at: Utc::now(),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Create a new overlay repository source.
     pub const fn overlay_repo(org: String, repo: String, name: String, commit: String) -> Self {
         Self::OverlayRepo {
             org,
             repo,
             name,
